
var status = -1;
const id = 2430178;
const cfg = [
    //英雄
    {id : 2431124, job : 11},  //阿基里斯    30/50
    {id : 2431210, job : 11},  //冒险岛勇士   10/50
    {id : 2431203, job : 11},  //进阶斗气    10/50
    {id : 2431212, job : 11},  //稳如泰山    10/40
    {id : 2431218, job : 11},  //轻舞飞扬    10/50
    {id : 2431201, job : 11},  //葵花宝典    10/50
    {id : 2431216, job : 11},  //突进      10/50

    //圣骑士
    {id : 2431245, job : 12},  //阿基里斯        30/50
    {id : 2431240, job : 12},  //冒险岛勇士   10/50
    {id : 2431246, job : 12},  //寒冰盾     10/50
    {id : 2431242, job : 12},  //稳如泰山    10/40
    {id : 2431241, job : 12},  //万佛归一破   10/20
    {id : 2431243, job : 12},  //圣灵之剑    10/40
    {id : 2431244, job : 12},  //圣灵之锤    10/40
    {id : 2431247, job : 12},  //突进          10/50
    {id : 2431249, job : 12},  //连环环破        10/60

    //黑骑士
    {id : 2431340, job : 13},  //冒险岛勇士   10/50
    {id : 2431342, job : 13},  //稳如泰山    10/40
    {id : 2431343, job : 13},  //突进      10/50
    {id : 2431345, job : 13},  //阿基里斯    30/50
    {id : 2431346, job : 13},  //恶龙附身    10/60

    //主教
    {id : 2432140, job : 23},  //冒险岛勇士   10/50
    {id : 2432141, job : 23},  //创世之破    10/40
    {id : 2432142, job : 23},  //魔法反击    10/70
    {id : 2432143, job : 23},  //强化圣龙    10/60
    {id : 2432145, job : 23},  //圣灵之盾    10/60
    {id : 2432147, job : 23},  //光芒飞箭    10/60
    {id : 2432148, job : 23},  //圣光普照        10/60

    //冰雷魔导师
    {id : 2432240, job : 22},  //冒险岛勇士   10/50
    {id : 2432241, job : 22},  //创世之破    10/40
    {id : 2432242, job : 22},  //魔法反击    10/70
    {id : 2432243, job : 22},  //冰凤球         10/60
    {id : 2432245, job : 22},  //火魔兽         10/60
    {id : 2432246, job : 22},  //链环闪电    10/60
    {id : 2432247, job : 22},  //落霜冰破    10/60

    //火毒魔导师
    {id : 2432340, job : 21},  //冒险岛勇士   10/50
    {id : 2432341, job : 21},  //创世之破    10/40
    {id : 2432342, job : 21},  //魔法反击    10/70
    {id : 2432343, job : 21},  //火凤球         10/60
    {id : 2432345, job : 21},  //冰破魔兽        10/60
    {id : 2432346, job : 21},  //连环爆破    10/60
    {id : 2432347, job : 21},  //天降落星    10/60

    //神射手
    {id : 2433140, job : 31},  //冒险岛勇士   10/50
    {id : 2433142, job : 31},  //火眼晶晶    30/60
    {id : 2433143, job : 31},  //飞龙冲击波   30/60
    {id : 2433144, job : 31},  //暴风箭雨        20/40
    {id : 2433145, job : 31},  //神箭手     30/60
    {id : 2433146, job : 31},  //火凤凰     30/40
    {id : 2433147, job : 31},  //击退箭         30/50
    {id : 2433148, job : 31},  //集中精力    30/40

    //箭神
    {id : 2433240, job : 32},  //冒险岛勇士   10/50
    {id : 2433241, job : 32},  //穿透箭
    {id : 2433242, job : 32},  //火眼晶晶    30/60
    {id : 2433243, job : 32},  //飞龙冲击波
    {id : 2433245, job : 32},  //冰凤凰
    {id : 2433246, job : 32},  //刺眼箭
    {id : 2433247, job : 32},  //一击要害箭

    //隐士
    {id : 2434140, job : 41},  //冒险岛勇士   10/50
    {id : 2434142, job : 41},  //假动作
    {id : 2434143, job : 41},  //挑衅
    {id : 2434145, job : 41},  //武器用毒液
    {id : 2434147, job : 41},  //三连环光击破

    //侠客
    {id : 2434240, job : 42},  //冒险岛勇士   10/50
    {id : 2434242, job : 42},  //假动作         10/50
    {id : 2434245, job : 42},  //武器用毒液   10/60
    {id : 2434246, job : 42},  //烟雾弹         10/40
    {id : 2434247, job : 42},  //一出多击    10/60

    //冲锋队长
    {id : 2435040, job : 51},
    {id : 2435041, job : 51},
    {id : 2435042, job : 51},
    {id : 2435043, job : 51},
    {id : 2435044, job : 51},
    {id : 2435045, job : 51},
    {id : 2435047, job : 51},
    {id : 2435049, job : 51},

    //船长
    {id : 2435140, job : 52},
    {id : 2435141, job : 52},
    {id : 2435143, job : 52},
    {id : 2435144, job : 52},
    {id : 2435147, job : 52},
    {id : 2435148, job : 52},
];

// 4转自选技能书

function start() {
  status = -1;
  action(1, 0, 0);
}

function action(mode, type, selection) {

    if(mode <= 0){
        im.dispose();
        return;
    }
	
    if (mode === 1) {
        status++;
    } else {
        status--;
    }

    if(!im.haveItem(id)){
		//强开
		im.dispose();
		return;
	}
	
	if (status === 0) {

		let job = parseInt(im.getJobId() / 10);

        sk = cfg.filter(v=> v.job === job);

        if(sk.length > 0){
            var text = "\r\n\t请选择你需要的能手册！\r\n"

            text += "\r\n#b"
            sk.forEach((v,i) => {
                text += `#L${v.id}# #i${v.id}:# #t${v.id}:# #l`
                if((i+1) % 1 === 0){
                    text += "\r\n"
                } 
            })

            text += "　\r\n"

            im.sendSimple(text);
        } else {
            im.dropMessage("请转职后再打开！");
            im.dispose();
        }

    } else if (status === 1){


    	var text = `\t你确定要 #i${selection}:# #r#t${selection}:##k 吗？\r\n`

    	text += "\r\n#b";
    	text += `#L${selection}#是的，给我吧！\r\n`
    	text += "#L9#我再看看！\r\n";
    	im.sendSimple(text);

    } else if (status === 2) {

    	if(selection === 9){
    		status =-1;
    		action(1,0,0);
    	} else {
    		if(im.canHold(selection)){
    			im.gainItem(id,-1);
    			im.gainItem(selection,1);
    			im.sendNext("给你，请拿好！");
    			im.getPlayer().serverMessage("打开自选能手册(4转)获得" , selection);
    		} else {
    			im.sendNext("背包空间不足");
    			
    		}
    		im.dispose();
    	}
    	

	
	} else {
		im.dispose();
	}

	
}
